tutorials/OF-RTM/L-Section/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// block definition for a porosity with an angled inlet/outlet
// the porosity is not aligned with the main axes
//
                        
convertToMeters 0.001;

vertices
(
    ( -46.8012701892207 25.9378221735102 50) //0
    ( -3.49999999999958 0.937822173508688 50) //1
    ( -3.49999999999958 0.937822173508688 0) //2
    ( -46.8012701892207 25.9378221735102 0) //3
    
    ( -45.8012701892208 27.6698729810791 50) //4
    ( -2.4999999999997 2.66987298107763 50) //5
    ( -2.4999999999997 2.66987298107763 0) //6
    ( -45.8012701892208 27.6698729810791 0) //7
    
    ( 3.49999999999958 0.937822173508688 50) //8
    ( 3.49999999999958 0.937822173508688 0) //9
    ( 2.4999999999997 2.66987298107763 50) //10
    ( 2.4999999999997 2.66987298107763 0) //11
    
    ( 46.8012701892207 25.9378221735102 50) //12
    ( 46.8012701892207 25.9378221735102 0) //13
    
    ( 45.8012701892208 27.6698729810791 50) //14
    ( 45.8012701892208 27.6698729810791 0) //15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) cavity ( 50 50 4 ) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) cavity ( 10 50 4 ) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) cavity ( 50 50 4 ) simpleGrading (1 1 1)
);

edges
(
    arc 1 8 ( 0 0 50 )
    arc 2 9 ( 0 0 0 )
    arc 5 10 ( 0 2 50 )
    arc 6 11 ( 0 2 0 )
);

patches
(
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (12 13 15 14)
    )
    patch lowerMold
    (
        (0 3 2 1)
        (1 2 9 8)
        (8 9 13 12)
    )
    patch upperMold
    (
        (4 5 6 7)
        (5 10 11 6)
        (10 14 15 11)
    )
    patch sides
    (
        (0 1 5 4)
        (1 8 10 5)
        (8 12 14 10)
        (3 7 6 2)
        (2 6 11 9)
        (9 11 15 13)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
