tutorials/OF-RTM/L-Section/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions	[1 -1 -2 0 0 0 0];

internalField	uniform 1e5;


boundaryField
{
	inlet
	{
		type	        	uniformFixedValue;
		uniformValue           	table
							(
								(0 1e5)
								(0.005 2e5)
								(10 2e5)
							);
	}

	
	outlet
	{
		type	        	fixedValue;
		value           	uniform 1e5;
	}       

        sides
        {
        type            fixedFluxPressure;
		value           	uniform 1e5;
        }

        lowerMold
        {
        type            fixedFluxPressure;
		value           	uniform 1e5;
        }

        upperMold
        {
        type            fixedFluxPressure;
		value           	uniform 1e5;
        }
}


// ************************************************************************* //
