tutorials/OF-RTM/L-Section/0/T.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 393.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 393.15;
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerMold
    {
        type            fixedValue;
        value           uniform 393.15;
    }
    upperMold
    {
        type            fixedValue;
        value           uniform 393.15;
    }
    sides
    {
        type            fixedValue;
        value           uniform 393.15;
    }
}


// ************************************************************************* //
