tutorials/OF-RTM/L-Section/0/drapeDirection
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      drapeDirection;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions	[0 0 0 0 0 0 0];

internalField	uniform (1 0 0);

boundaryField
{
	inlet
	{
                type                    zeroGradient;
	}

	
	outlet
	{
		type 			zeroGradient;
	}

        lowerMold
        {
                type                    zeroGradient;
        }

        upperMold
        {
                type                    zeroGradient;
        }

        sides
        {
                type                    zeroGradient;
        }
}


// ************************************************************************* //
